app/Controllers/FilmController.php

    public function index(): ResponseInterface
    {
        $requestToken = $this->request->getHeaderLine('Authorization');

        if ($requestToken !== "Bearer " . $this->token) {
            return $this->response->setJSON([
                'error' => 'No se puede acceder, el token es inválido'
            ])->setStatusCode(401);
        }

        $data = $this->filmModel->select("films.*, COALESCE(string_agg(a.name || ' ' || a.surname, ', '), '') AS actors")
            ->join('perform AS p', 'films.filmId = p.filmId', 'left')
            ->join('actors AS a', 'a.personId = p.personId', 'left')
            ->groupBy('films.filmId')
            ->findAll();
---
SELECT "films".*, COALESCE(string_agg(a.name || ' ' || a.surname, ', '), '') AS actors
FROM "films"
LEFT JOIN "perform" AS "p" ON "films"."filmId" = "p"."filmId"
LEFT JOIN "actors" AS "a" ON "a"."personId" = "p"."personId"
GROUP BY "films"."filmId"

    public function delete()
    {
        $requestToken = $this->request->getHeaderLine('Authorization');

        if ($requestToken !== "Bearer " . $this->token) {
            return $this->response->setJSON([
                'error' => 'No se puede acceder, el token es inválido'
            ])->setStatusCode(401);
        }

        $id = $this->request->getJSON()->filmId;

        if (ENVIRONMENT == 'testing') {
            return $this->response->setJSON(true);
        } else {
            /**eliminamos la peli */
            $affectedRows = $this->filmModel->where('filmId', $id)->delete();
---
DELETE FROM "films"
WHERE "filmId" = '17'