app/Controllers/UserController.php

    private function processUserData($user)
    {
        if (!$user) {
            return null;
        }

        // Add base64 encoded profile picture
        $user['base64'] = $this->base64($user['pfp']);

        // Fetch friends
        $user['friends'] = $this->userModel
            ->select('users.id, users.nombre, users.apellidos, users.email, users.username, users.pfp')
            ->join('amuzik.friends', 'users.id = friends.user1 OR users.id = friends.user2')
            ->groupStart()
                ->where('friends.user1', $user['id'])
                ->orWhere('friends.user2', $user['id'])
            ->groupEnd()
            ->where('users.id !=', $user['id'])
            ->findAll();
---
SELECT "users"."id", "users"."nombre", "users"."apellidos", "users"."email", "users"."username", "users"."pfp"
FROM "users"
JOIN "amuzik"."friends" ON "users"."id" = "friends"."user1" OR "users"."id" = "friends"."user2"
WHERE   (
"friends"."user1" = '1'
OR "friends"."user2" = '1'
 )
AND "users"."id" != '1'

    public function login()
    {
        // $tokenValidation = $this->validateToken();
        // if ($tokenValidation !== true) {
        //     return $tokenValidation;
        // }

        $jsonBody = $this->request->getJSON();
        $username = $jsonBody->username ?? null;
        $password = $jsonBody->password ?? null;

        if (!$username || !$password) {
            return $this->response->setJSON([
                'error' => 'Username y password son requeridos'
            ])->setStatusCode(400);
        }

        $user = $this->userModel->where('username', $username)->first();
---
SELECT *
FROM "users"
WHERE "username" = 'admin'
 LIMIT 1

    public function userInfo()
    {
        $tokenValidation = $this->validateToken();
        if ($tokenValidation !== true) {
            return $tokenValidation;
        }

        $userId = $this->request->getGet('id');
        if (!$userId) {
            return $this->response->setJSON([
                'error' => 'ID de usuario requerido'
            ])->setStatusCode(400);
        }

        $user = $this->userModel->find($userId);
---
SELECT *
FROM "users"
WHERE "users"."id" = '6'